a = 10
b = 'abcde'
c = "hello"
d = 3.14


b = '파이썬은 모두 참조타입이므로 덮어쓰기가 가능함'
c = "메모리가 어떻게 사용되는지는 항상 알아둘 것 "

print('a 는',a, ' / 타입은', type(a))
print('b 는',b, ' / 타입은', type(b))
print('c 는',c, ' / 타입은', type(c))
print('d 는',d, ' / 타입은', type(d))

a = 1.234
print('a 는',a, ' / 타입은', type(a))

# 한줄주석

''' 
여러줄 주석
'''
_a = 12 # 클래스명은 자바랑 동일 _ 까지 가능

''' 
# 산술연산자 
+,-, *, /(소수점 결과), //(정수 결과), %
++, -- 가 없음

# 비교연산자
>, >=, <, <=, ==, != 

# 관계연산자
A and B
or
not
True / False 첫글자는 대문자

# 비트연산자
&
|
^

# 대입연산자 : 오른쪽의 값을 왼쪽 변수에 할당
=
+=  ex) a+=1 # a의 값 1 증가, a=a+1
-=      a=a-3
*=      
/=
**=
//=
|=

'''
